In [1]:
import pandas as pd

In [2]:
df1 = pd.util.testing.makeMixedDataFrame()
df2 = df1.drop([2,3],axis='rows')

In [3]:
df1

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [4]:
df2

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
4  4.0  0.0  foo5 2009-01-07

In [5]:
pd.merge(df1, df2, how='left', indicator=True)

     A    B     C          D     _merge
0  0.0  0.0  foo1 2009-01-01       both
1  1.0  1.0  foo2 2009-01-02       both
2  2.0  0.0  foo3 2009-01-05  left_only
3  3.0  1.0  foo4 2009-01-06  left_only
4  4.0  0.0  foo5 2009-01-07       both